package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/HuiFont.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class HuiFont extends FontData
	{
		public function HuiFont() 
		{
			_url = "http://hp.vector.co.jp/authors/VA039499/";
			_isRedistributable = true;
			_version = "2.9";
			_fontNameList = [new HuiFont_df3().fontName, new HuiFontP_df3().fontName];
			_info = "手書きかなフォント「ふい字」\n";
			_info += "\n";
			_info += "----------------------------------------------------------------------\n";
			_info += "【フォント名】  ふい字(HuiFont) v2.9\n";
			_info += "【著作権】　	ふい\n";
			_info += "【対応OS】　	Windows 95/98/Me/NT4.0/2000/XP\n";
			_info += "                MacOS X 10.1以降も多分大丈夫。\n";
			_info += "【種別】　	フリーウェア \n";
			_info += "----------------------------------------------------------------------\n";
			_info += "\n";
			_info += "→　ふい字について。\n";
			_info += "\n";
			_info += "「ふい字」は、２バイトのTrueTypeプロポーショナルフォントです。\n";
			_info += "わりと普通に制作者の手書き文字です。\n";
			_info += "入っている文字は、\n";
			_info += "　ひらがな/全角・半角カタカナ/全角・半角数字/全角・半角アルファベット/\n";
			_info += "　ギリシャ文字/ロシア文字/各種記号/シフトJIS第一水準漢字/絵文字/\n";
			_info += "　シフトJIS第二水準漢字/その他漢字など\n";
			_info += "です（v2.9現在）。\n";
			_info += "ひそかに縦書き対応です。\n";
			_info += "\n";
			_info += "\n";
			_info += "\n";
			_info += "→　ご使用について。\n";
			_info += "\n";
			_info += "「ふい字」はフリーウェアです。\n";
			_info += "また、個人/商用/オンライン/オフラインかかわらず、好きにお使いいただけます。\n";
			_info += "素材・ＨＰなどへの使用もご自由に。\n";
			_info += "ただし、フォントファイル本体の販売・加工はご遠慮ください。\n";
			_info += "再配布・掲載については事前にお知らせください。\n";
			_info += "まだふつつかな我が子なのです。\n";
			_info += "\n";
			_info += "「ふい字」の著作権はふいにあります。\n";
			_info += "なお、「ふい字」を使用して、なにか面倒事が起こったとしても、一切責任持てません。あしからず。\n";
			_info += "\n";
			_info += "「ふい字」を作った人は、素で間違えながら生きているかわいそうなひとなので、\n";
			_info += "たぶん絶対誤字があります。あったらぜひとも教えてくれなさい。\n";
			_info += "というか、たぶん他にもいろいろ不備があるかと思います。すみません。\n";
			_info += "\n";
			_info += "基本的に報告は不要ですが、使っていただいたら、メールなどで一言事後報告でもしてやっていただけると喜びます。\n";
			_info += "\n";
			_info += "\n";
			_info += "\n";
			_info += "→　絵文字について。\n";
			_info += "\n";
			_info += "「ふい字」には、通常罫線を表示する部分の一部に20種類の絵文字が入っています。\n";
			_info += "罫線は、文字コード表・文字パレット等を使うか、「けいせん」と打って変換すると、変換候補に出てきます。\n";
			_info += "また、「うﾞ」の文字はシフトJISコード84AA『━』に入っています。\n";
			_info += "\n";
			_info += "罫線を一部潰したため、当然アスキーアートの表示などに支障がでます。勘弁してください。\n";
			_info += "\n";
			_info += "\n";
			_info += "\n";
			_info += "----更新履歴---------------------------------------------------------\n";
			_info += "2004.08.08\n";
			_info += "v1.0\n";
			_info += "　「ふい字」を公開。\n";
			_info += "　シフトJIS第一水準まで入れました。\n";
			_info += "\n";
			_info += "2004.08.14\n";
			_info += "v1.1\n";
			_info += "　シフトJIS第二水準漢字を一部追加（コード989F～9B76）。\n";
			_info += "\n";
			_info += "2004.08.21\n";
			_info += "v1.2\n";
			_info += "　シフトJIS第二水準漢字を一部追加（コード9B77～E0F1）。\n";
			_info += "　漢字の線の太さなどをこっそり調整しました。\n";
			_info += "\n";
			_info += "2004/10/21\n";
			_info += "v2.0\n";
			_info += "　シフトJIS第二水準漢字を一部追加（コードE0F2～EAA4）。\n";
			_info += "　これで一応、全てのシフトJIS第二水準漢字に対応したので、キリよくv2.0としました。\n";
			_info += "\n";
			_info += "2004/12/04\n";
			_info += "v2.1\n";
			_info += "　縦書き専用文字の汚れを取り除いたり、形を整えたりしました。\n";
			_info += "\n";
			_info += "2006/01/01\n";
			_info += "v2.3\n";
			_info += "　「裕」「萌」の誤字を修正。あと微妙に色々整えたかも。\n";
			_info += "　ご指摘くださったaoさん、ありがとうございました。\n";
			_info += "　便宜上、ふい字Ｐと合わせてv2.3としました。\n";
			_info += "\n";
			_info += "2006/01/16\n";
			_info += "v2.4\n";
			_info += "　人名用漢字などを32字追加し、記号など気持ち微調整をしました。\n";
			_info += "　「＿」「￣」「拳」の誤字を修正。\n";
			_info += "　ご指摘くださった多くのみなさん、ありがとうございました。\n";
			_info += "\n";
			_info += "2006/02/20\n";
			_info += "v2.5\n";
			_info += "　「＄」「￠」の誤字を修正。\n";
			_info += "　ご指摘くださった佐垣内さん、ありがとうございました。\n";
			_info += "　文字位置の再調整と、第一水準漢字までの目立つ潰れや汚れの修正をしました。\n";
			_info += "\n";
			_info += "2006/03/05\n";
			_info += "v2.6\n";
			_info += "　「械」の誤字を修正。\n";
			_info += "　ご指摘くださったTAIYUさん、ありがとうございました。\n";
			_info += "\n";
			_info += "2006/05/08\n";
			_info += "v2.7\n";
			_info += "　「喪」の誤字を修正。\n";
			_info += "　ご指摘くださったくらもとさん、ありがとうございました。\n";
			_info += "　ご使用についてを一部変更しました。\n";
			_info += "\n";
			_info += "2006/10/30\n";
			_info += "v2.8\n";
			_info += "　「晒」の誤字を修正。\n";
			_info += "　ご指摘くださったTAIYUさん、ありがとうございました。\n";
			_info += "\n";
			_info += "2007/08/01\n";
			_info += "v2.9\n";
			_info += "　「g」「～」を修正、「寡」「券」「帽」「睡」「燦」の誤字を修正。\n";
			_info += "　ご指摘くださった多くのみなさん、ありがとうございました。\n";
			_info += "------------------------------------------------------------------^-^\n";
			_info += "\n";
			_info += "ふい　huiko@1mg.jp\n";
			_info += "http://hp.vector.co.jp/authors/VA039499/\n";
			_info += "\n";
			_info += "(C)hui 2004\n";
			_info += "";
			super();
		}
	}
	
}