package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/ibaraji.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class ibaraji extends FontData
	{
		public function ibaraji() 
		{
			_url = "http://www2s.biglobe.ne.jp/~fub/font/ibaraji.html";
			_isRedistributable = false;
			_version = "1.1";
			_fontNameList = [new ibaraji_df3().fontName];
			_info = "===============================================================================\n";
			_info += "| タイトル | イバラ字 version 1.1\n";
			_info += "|ファイル名| ibaraji.ttf\n";
			_info += "| カテゴリ | フォント(TrueTypeFont)\n";
			_info += "| 制作者　 | fub\n";
			_info += "| 動作環境 | Windows 95/98/Me/NT4.0/2000/XP\n";
			_info += "===============================================================================\n";
			_info += "\n";
			_info += "このたびは、「イバラ字」をダウンロードいただき、まことにありがとうございます。\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "1.イバラ字の特徴\n";
			_info += "\n";
			_info += "字形も雰囲気も尖った感じのフォントです。\n";
			_info += "等幅フォントです。\n";
			_info += "\n";
			_info += "半角英数・半角カナ\n";
			_info += "ひらがな・カタカナ・記号・アルファベット・ギリシャ文字・ロシア文字\n";
			_info += "教育漢字(1006文字)を収録（縦書き対応）\n";
			_info += "\n";
			_info += "字形はJIS 90を参考にしています。\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "2.インストール方法\n";
			_info += "\n";
			_info += "・コントロールパネルのフォントを選ぶ\n";
			_info += "・ファイル→新しいフォントのインストールを選ぶ\n";
			_info += "・「イバラ字」を選んでOKボタンを押す\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "3.著作権について\n";
			_info += "\n";
			_info += "・「イバラ字」の著作権はfubにあります。\n";
			_info += "・再配布は無料配布に限りますが、雑誌、書籍、CD-ROM収録の際はご一報ください。\n";
			_info += "・WEBサイト、印刷物、映像への利用は個人、商用問わずＯＫですが、商標権などの権利を\n";
			_info += "取得するロゴに対しては使用をご遠慮ください。\n";
			_info += "・このフォントの使用によるトラブル、不利益には一切の責任を負いません。\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "4.フォント作成環境\n";
			_info += "\n";
			_info += "武蔵システム「TTEdit」で作成しました。\n";
			_info += "http://musashi.or.tv\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "5.更新履歴\n";
			_info += "\n";
			_info += "2008/8/29	ver 1.0		教育漢字(1006文字)まで作成\n";
			_info += "2008/11/3	ver 1.1		誤字修正、字面調整\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "\n";
			_info += "/***************************************************\n";
			_info += "\n";
			_info += "	fub\n";
			_info += "\n";
			_info += "	素材集サイト「fub工房」\n";
			_info += "	http://www2s.biglobe.ne.jp/~fub/\n";
			_info += "\n";
			_info += "	fub@mri.biglobe.ne.jp\n";
			_info += "\n";
			_info += "***************************************************/\n";
			_info += "";

			super();
		}
	}
	
}