package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/jnrttf.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class jnrttf extends FontData
	{
		public function jnrttf() 
		{
			_url = "http://makufont.dip.jp/memo/?page_id=1178";
			_fontNameList = [new jnrttf_df3().fontName];
			_isRedistributable = false;
			_info = "------------------------------------------------------------------------------------------------\n";
			_info += "＜プログラム名＞　「国鉄方向幕書体」v1.2 FR-2\n";
			_info += "　　　　　　　　　※ただしデザイン企業様にてクライアント企業様向けにデザインをご提案される際など\n";
			_info += "　　　　　　　　　　国鉄という冠詞が使えない場合は、「ロールズ隅丸ルーズウェイト」と表記下さい。\n";
			_info += "　　　　　　　　　　\n";
			_info += "＜サポート文字＞　常用漢字、教育漢字、市町村名漢字、新聞漢字、全国駅名漢字、ひらがな、カタカナ、英字\n";
			_info += "　　　　　　　　および一部の記号類。出力できない文字で、業務上でどうしても必要な物がある場合、\n";
			_info += "　　　　　　　　具体的内容をお知らせ頂ければ対応可能な場合があります。お気軽にお問い合わせ下さい。\n";
			_info += "\n";
			_info += "＜動作対象＞TTFフォント、OTFフォントの動作する環境であれば準拠となります。\n";
			_info += "　　　　　　不具合についてはご報告をお願いいたします。\n";
			_info += "　　　　　　\n";
			_info += "＜お問い合わせ＞ロールズ開発部門メールアドレス　rolls_kanri@yahoo.co.jp　まで\n";
			_info += "　　　　　　\n";
			_info += "＜ライセンス＞成果物フリー、ただし以下の利用許諾条件に同意された場合のみ、使用を許可します。\n";
			_info += "\n";
			_info += "＜著作権＞ロールズが全ての権利を有します。\n";
			_info += "------------------------------------------------------------------------------------------------\n";
			_info += "\n";
			_info += "\n";
			_info += "\n";
			_info += "＜使用許諾条件＞　国鉄方向幕書体　TTF/OTF　v1.0以降対象\n";
			_info += "\n";
			_info += "①データに関する全ての権利は著作者にあります。本プログラムが正式な１．０版リリースとなります。\n";
			_info += "　過去の版についてはご使用いただけなくなりますのでご了承下さい。\n";
			_info += "\n";
			_info += "　(特例)ただし旧版ひらがなの使用を続けたい場合のため０．０７ｘ版へのダウングレードを許可します。\n";
			_info += "\n";
			_info += "②使用者の所有するパソコン(複数)にインストールし使用することができます。\n";
			_info += "　使用者は、個人、法人を問いません。\n";
			_info += "\n";
			_info += "③販売、譲渡、添付等いかなる手段でも第三者へ二次配布することは禁止します。\n";
			_info += "　ただし権利者の許可が得られた場合はこの限りではありません。付随データ、変換データも同様です。\n";
			_info += "　配布したい、雑誌に同封したい、そういった場合は rolls_kanri@yahoo.co.jp へお問い合わせ下さい。\n";
			_info += "　\n";
			_info += "　(特例)商品のポップ、広告媒体などのデザインのためにAdobe社のIllustrator(同社登録商標)などを使用し\n";
			_info += "　　　　当フォントをアウトラインとして作品原本画へ埋め込むことは許可します(これは印字とみなします)。\n";
			_info += "　　　　同様に、PDFに出力した当フォントの文字をIllustratorで取り込み、アウトライン化して再利用する\n";
			_info += "　　　　ことも許可します。\n";
			_info += "　　　　この場合、Illustratorでアウトライン化した後であれば、部首の取替え、加工等に制約はありません。\n";
			_info += "\n";
			_info += "④本製品を権利者の許諾を得ることなく改変したり、またそれを公開することはできません。ただし、\n";
			_info += "　本フォントをテキスト入力に使用して作成した成果物については、それら著作者の権利にて活用する\n";
			_info += "　ことができます。成果物を販売する目的であっても同様です(成果物販売に制約なし)。\n";
			_info += "　例として、企業の販促広告媒体への印字、ウェブページの画像への文字配置など、無償有償を問わず\n";
			_info += "　テキスト入力での使用に制限はありません。\n";
			_info += "　\n";
			_info += "⑤本フォント著作者は、本フォントを使用した場合のいかなる損害についても補償しません。\n";
			_info += "　正しく楽しく使いましょう。\n";
			_info += "\n";
			_info += "⑥本フォントについて、旧国鉄やJR各社、またはその関連企業等とは一切関係ありません。\n";
			_info += "\n";
			_info += "\n";
			_info += "copyright (C)2005-2010 ロールズ\n";
			_info += "\n";
			_info += "\n";
			_info += "謝辞\n";
			_info += "\n";
			_info += "バージョン１．０のReleaseにあたり、多数の皆様に無償のご協力を頂きました。\n";
			_info += "皆様の貴重な時間をお借りしたこと大変恐縮に感じております。おかげ様で、１．０のReleaseとなりました。\n";
			_info += "本来であれば直接お会いし、御礼申し上げるべきところ、Readme内で申し訳ございません。特に、１．０版の\n";
			_info += "Releaseに際しては、最終的なアルファベットのスタイルの確定とこの実装を可能にしてくださり、また全ての面で\n";
			_info += "監修をいただいた「熟成ウニ茶」様、本プログラムのReleaseにあたり、１．０のプログラム試験に精力的に\n";
			_info += "ご参加いただきました「att」様「つら」様、「オーサト様」、全駅名の洗い出しの作業に休日の全てを捧げて\n";
			_info += "くださった「二枚橋」様「ぬこ鍋」様、市町村漢字の抽出をしていただいた「思野」様、モチベーションの維持に\n";
			_info += "全方向からバックアップ頂きました「中央大学理工学部鉄道研究会」の皆様、そして、０．０９版までの\n";
			_info += "開発にお力添えを下さった全ての皆様、本当にありがとうございました。皆様のお力があって初めてReleaseが\n";
			_info += "可能となった１．０版であること、ここに深く厚く御礼申し上げます。\n";
			_info += "\n";
			_info += "\n";
			_info += "";
			super();
		}
	}
	
}