package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/mofuji.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class mofuji extends FontData
	{
		public function mofuji() 
		{
			_url = "http://www2s.biglobe.ne.jp/~fub/font/mofuji.html";
			_isRedistributable = false;
			_version = "1.3";
			_fontNameList = [new mofuji_df3().fontName];
			_info = "===============================================================================\n";
			_info += "| タイトル | モフ字 version 1.3\n";
			_info += "|ファイル名| mofuji.ttf\n";
			_info += "| カテゴリ | フォント(TrueTypeFont)\n";
			_info += "| 制作者　 | fub\n";
			_info += "| 動作環境 | Windows 95/98/Me/NT4.0/2000/XP\n";
			_info += "===============================================================================\n";
			_info += "\n";
			_info += "このたびは、「モフ字」をダウンロードいただき、まことにありがとうございます。\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "1.モフ字の特徴\n";
			_info += "\n";
			_info += "モフモフした感じの文字です。\n";
			_info += "角が全く無く、曲線のみでつくられている文字です。\n";
			_info += "一部判読しづらい字もありますが、雰囲気を重視しておりますのでご了承ください。\n";
			_info += "\n";
			_info += "半角英数・半角カナ\n";
			_info += "ひらがな・カタカナ・アルファベット・ギリシャ文字・ロシア文字\n";
			_info += "第一水準漢字をサポート\n";
			_info += "※ネット配布版では第二水準漢字・IBM拡張文字は含まれません\n";
			_info += "\n";
			_info += "字形はJIS 90を参考にしています。\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "2.インストール方法\n";
			_info += "\n";
			_info += "・コントロールパネルのフォントを選ぶ\n";
			_info += "・ファイル→新しいフォントのインストールを選ぶ\n";
			_info += "・「モフ字」を選んでOKボタンを押す\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "3.著作権について\n";
			_info += "\n";
			_info += "・「モフ字」の著作権はfubにあります。\n";
			_info += "・再配布は無料配布に限りますが、雑誌、書籍、CD-ROM収録の際はご一報ください。\n";
			_info += "・WEBサイト、印刷物、映像への利用は個人、商用問わずＯＫです。\n";
			_info += "・このフォントの使用によるトラブル、不利益には一切の責任を負いません。\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "4.フォント作成環境\n";
			_info += "\n";
			_info += "武蔵システム「TTEdit」で作成しました。\n";
			_info += "http://musashi.or.tv\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "5.更新履歴\n";
			_info += "\n";
			_info += "2007/10/29	ver 1.3		縦書き専用文字作成\n";
			_info += "2007/06/07	ver 1.2		69文字字形調整\n";
			_info += "				Vector公開（JIS第一水準漢字まで）\n";
			_info += "2007/05/23	ver 1.1		全体字形微調整\n";
			_info += "				デザインフェスタvol.25に出展\n";
			_info += "2007/05/12	ver 1.0		IBM拡張文字まで作成\n";
			_info += "\n";
			_info += "_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n";
			_info += "\n";
			_info += "/***************************************************\n";
			_info += "\n";
			_info += "	fub\n";
			_info += "\n";
			_info += "	素材集サイト「fub工房」\n";
			_info += "	http://www2s.biglobe.ne.jp/~fub/\n";
			_info += "\n";
			_info += "	fub@mri.biglobe.ne.jp\n";
			_info += "\n";
			_info += "***************************************************/\n";
			_info += "";

			super();
		}
	}
	
}