package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/OhisamaFont.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class OhisamaFont extends FontData implements IFontData
	{
		public function OhisamaFont() 
		{
			_url = "http://hp.vector.co.jp/authors/VA039499/#ohisama";
			_fontNameList = [new OhisamaFont_df3().fontName, new OhisamaFontB_df3().fontName];
			_info = "----------------------------------------------------------------------\n";
			_info += "【フォント名】  おひさまフォント(OhisamaFont) v1.1\n";
			_info += "【著作権】　	ふい\n";
			_info += "【対応OS】　	Windows 95/98/Me/NT/2000/XP\n";
			_info += "                MacOS X 10.1以降も多分大丈夫。\n";
			_info += "                （Windows Vistaでは動作確認していません。）\n";
			_info += "【種別】　	フリーウェア \n";
			_info += "----------------------------------------------------------------------\n";
			_info += "\n";
			_info += "→　おひさまフォントについて。\n";
			_info += "\n";
			_info += "「おひさまフォント」は、２バイトのTrueType等幅フォントです。\n";
			_info += "細めの線と、極端な右上がりが特徴です。\n";
			_info += "今時の若い娘さん的な、アッパーな可愛さを目指しましたが、相変わらず微妙です。\n";
			_info += "\n";
			_info += "\n";
			_info += "入っている文字は、\n";
			_info += "ひらがな/全角・半角カタカナ/全角・半角数字/全角・半角アルファベット/ギリシャ文字（小文字だけ）/\n";
			_info += "各種記号/絵文字/シフトJIS第一水準漢字/シフトJIS第二水準漢字の、わりと使いそうな字を適当にチョイス（４６７字くらい）\n";
			_info += "です。\n";
			_info += "日常の文章で困ることはあんまりないはず。\n";
			_info += "一応縦書き対応ですが、右上がり文字の性質上、あまり見栄えはよくならない気がします。\n";
			_info += "\n";
			_info += "\n";
			_info += "→　おひさまフォント太について。\n";
			_info += "\n";
			_info += "単純に、「おひさまフォント」の線が太めになってます。それだけです。\n";
			_info += "もとが細めのフォントなので、こっちの方が使い勝手が良いこともある、かもしれません。\n";
			_info += "なお、太らせたぶんどうしても、細かい空白などが潰れてしまっていることがあります。ご注意。\n";
			_info += "\n";
			_info += "\n";
			_info += "→　ご使用について。\n";
			_info += "\n";
			_info += "「おひさまフォント」はフリーウェアです。\n";
			_info += "また、個人/商用/オンライン/オフラインかかわらず、好きにお使いいただけます。\n";
			_info += "素材・ＨＰなどへの使用もご自由に。\n";
			_info += "ただし、フォントファイル本体の販売・加工はご遠慮ください。\n";
			_info += "再配布・掲載については事前にお知らせください。\n";
			_info += "（お知らせさえいただければ、それだけで結構です。）\n";
			_info += "まだふつつかな我が子なのです。\n";
			_info += "\n";
			_info += "「おひさまフォント」の著作権はふいにあります。\n";
			_info += "なお、「おひさまフォント」を使用して、なにか面倒事が起こったとしても、一切責任持てません。あしからず。\n";
			_info += "\n";
			_info += "作った人は、素で間違えながら生きているかわいそうなひとなので、\n";
			_info += "たぶん絶対誤字があります。あったらぜひとも教えてくれなさい。\n";
			_info += "というか、たぶん他にもいろいろ不備があるかと思います。すみません。\n";
			_info += "\n";
			_info += "基本的に報告は不要ですが、使っていただいたら、メールなどで一言事後報告でもしてやっていただけると喜びます。\n";
			_info += "\n";
			_info += "\n";
			_info += "\n";
			_info += "----更新履歴---------------------------------------------------------\n";
			_info += "2008/07/10\n";
			_info += "v1.1\n";
			_info += "　「橙」「遽」「齊」「齋」を追加。\n";
			_info += "　「琶」「萌」「茶」「欄」の誤字を修正。\n";
			_info += "　Readme.txtを共通の内容にまとめました。\n";
			_info += "\n";
			_info += "2007/09/04\n";
			_info += "v1.0\n";
			_info += "　おひさまフォント太を公開しました。\n";
			_info += "---------------------------------------------------------------------\n";
			_info += "\n";
			_info += "\n";
			_info += "ふい　huiko@1mg.jp\n";
			_info += "http://hp.vector.co.jp/authors/VA039499/\n";
			_info += "\n";
			_info += "(C)hui 2007\n";
			_info += "";
			super();
		}
	}
	
}