package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/riitnr.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class riitnr extends FontData
	{
		public function riitnr() 
		{
			_url = "http://www.kcc.zaq.ne.jp/in-mlg/freefont/riitn/index.html";
			_isRedistributable = false;
			_version = "1.3";
			_fontNameList = [new riitnr_df3().fontName];
			_info = "「りいのフォント」のフリーフォントのご利用について\n";
			_info += "\n";
			_info += "フォントをダウンロードしてくださり、誠にありがとうございます。フォントをご利用の際は、ご利用規約を必ずお読みください。フォントを使用された場合、この規約に同意されたものとみなします。\n";
			_info += "\n";
			_info += "著作権について\n";
			_info += "\n";
			_info += "当サイトのフォントはフリーフォントですが、著作権は放棄しておりません。当サイトのフォントの著作権は、管理人「あおいりい」が所有しています。\n";
			_info += "\n";
			_info += "ご利用規約\n";
			_info += "\n";
			_info += "規約は予告なく変更されることがあります。（2009.8.5制定／2012.9.3改定・2013.6.7一部修正（追加））\n";
			_info += "\n";
			_info += "禁止事項\n";
			_info += "\n";
			_info += "フォントファイルの無断転載・再配布・販売・改変は禁止します。\n";
			_info += "公序良俗に反する行為・違法行為・アダルト・出会い系・宗教関係・その他迷惑行為等でのフォントの使用は禁止します。\n";
			_info += "当サイトのフォントを使用して作成したロゴ等の商標登録・意匠登録はご遠慮ください。\n";
			_info += "ご利用について\n";
			_info += "\n";
			_info += "上記の禁止・使用不可とさせていただいている行為を除き、どなたでも、用途や、商用・非商用を問わずご利用になれます。\n";
			_info += "商用利用される場合でも、ご利用方法に、上記の禁止事項以外の制限はありません。商品そのものへのご利用・名刺や看板等へのご利用・商品への文字入れサービス等でのご利用・作成代行サービス等でのご利用などもOKです。\n";
			_info += "同人・商業を問わず、性描写等の年齢制限のある創作物（漫画・小説・イラスト・ゲーム等）でのご利用も可能です。\n";
			_info += "webフォントとしてもご利用可能です（2012.9.3より）。\n";
			_info += "ゲーム・プログラム（パソコン用ソフトウェア・スマートフォン用アプリ等）でのフォントの埋め込みも可能です。\n";
			_info += "電子書籍でのフォントの埋め込みも可能です。\n";
			_info += "事前のご連絡や許可等は不要ですので、ご自由にご利用ください。ご利用に際してご不明な点がありましたら、メールでお気軽にお問い合わせください。\n";
			_info += "ご利用報告（事後報告）・リンクは大歓迎です（ご報告・リンク等は任意です）。リンクはバナーリンク・テキストリンクのどちらでもOKです。\n";
			_info += "フォントのご利用報告をいただいた場合、差し支えなければ当サイトで簡単にご紹介いたします。当サイトでのご紹介を希望される場合は、ご利用報告のメールでその旨をお知らせください（ご希望がない場合、基本的にはご紹介いたしません）。\n";
			_info += "商用利用された場合、カンパ歓迎です（カンパは任意です）。1円からお受けします。場合により、現物送付でも受け付けます。\n";
			_info += "カンパしてくださる場合は、フォントのご利用のご報告（事後報告）とともに、メールでお問い合わせください。送金口座／送付先をお知らせします。\n";
			_info += "フォントの掲載等について\n";
			_info += "\n";
			_info += "フォントを書籍・雑誌・Webサイト等でご紹介くださる場合は、事前にメールでご連絡をお願いします。\n";
			_info += "免責事項\n";
			_info += "\n";
			_info += "当サイトのフォントを使用したことによって生じたいかなる損害にも、当サイトは一切の責任を負いません。\n";
			_info += "予告なく、フォントの配布を終了することがありますので、ご了承ください。\n";
			_info += "その他\n";
			_info += "\n";
			_info += "管理人・あおいりいはあまりパソコンやフォントに詳しくないので、その辺りの細かいご質問はご遠慮ください。トラブル等がありましたら、ご報告いただけるとありがたいです。\n";
			_info += "もし、誤字や間違い等がありましたら、教えていただけると助かります。\n";
			_info += "申し訳ありませんが、「この文字が早くほしい」のようなご要望にはお応えできませんので、ご了承願います。";
			super();
		}
	}
	
}