package font
{
	
	/**
	 * ...
	 * QuickBuild:ctrl+F8
	 * @mxmlc -output bin/yojo.swf -compiler.library-path lib -default-size 592 400 -debug
	 * @author umhr
	 */
	public class yojo extends FontData implements IFontData
	{
		public function yojo() 
		{
			_url = "http://tanukifont.com/yojo-font/";
			_fontNameList = [new yojo_df3().fontName];
			_info = "===============================================================================\n";
			_info += "| タイトル | ようじょふぉんと version 1.00\n";
			_info += "|ファイル名| Yojo.ttf\n";
			_info += "| カテゴリ | フォント(TrueTypeFont)\n";
			_info += "| 制作者　 | たぬき侍\n";
			_info += "|作者サイト| http://tanukifont.sblo.jp/\n";
			_info += "===============================================================================\n";
			_info += "\n";
			_info += "このたびは「ようじょふぉんと」をダウンロードいただき、誠にありがとうございます。\n";
			_info += "\n";
			_info += "\n";
			_info += "_■「ようじょふぉんと」について\n";
			_info += "文字を覚えたての就学前の子ども（３～５歳ごろ）をイメージして作成した日本語フォントです。\n";
			_info += "収録されている文字はひらがな・数字のみですが、全角カタカナ・半角ｶﾀｶﾅにも字形を変えたひらがなを収録していますので、\n";
			_info += "「ぱぱ」「まま」「100てん」などの同じ文字が続く単語などであっても、フォントっぽさを若干ごまかすことができます。\n";
			_info += "\n";
			_info += "\n";
			_info += "■収録文字\n";
			_info += "ひらがな・数字・一部記号\n";
			_info += "\n";
			_info += "ひらがな には ひらがな（基本バージョン）\n";
			_info += "全角カタカナ には ひらがな（別バージョン）\n";
			_info += "半角ｶﾅｶﾅ には ひらがな（一部誤字バージョン）\n";
			_info += "全角数字 には 数字（基本バージョン）\n";
			_info += "半角数字 には 数字（別バージョン）\n";
			_info += "\n";
			_info += "を収録しています。\n";
			_info += "\n";
			_info += "\n";
			_info += "■ご利用について\n";
			_info += "個人・商用問わず、無料でご利用いただけますが、一部禁止事項がございます。\n";
			_info += "ご利用前に下記の注意事項と禁止事項を十分ご確認ください。\n";
			_info += "\n";
			_info += "\n";
			_info += "■注意事項\n";
			_info += "・「ようじょふぉんと」の著作権は作者であるたぬき侍に帰属します。\n";
			_info += "・WEBサイト、印刷物（同人誌を含む）、映像、ゲームへの埋め込み、iPhone/Androidアプリ、フォント埋込みＰＤＦでの使用は個人、商用問わず無料で利用可能です。\n";
			_info += "・出版社さまで発行する雑誌、書籍、CD-ROMへの収録の際は、たぬきフォント（http://tanukifont.sblo.jp/）サイト内のメールフォームよりご一報ください。その他の商用利用については報告は不要です。\n";
			_info += "・このフォントの使用によるトラブル、不利益には一切の責任を負いません。\n";
			_info += "・フォントに誤字等を発見した方はご連絡ください。なるべく速やかに修正いたします。\n";
			_info += "\n";
			_info += "\n";
			_info += "■禁止事項\n";
			_info += "・当フォントファイル(TTFファイル本体)を無断で販売する行為。\n";
			_info += "　当フォントを改変したものやトレースしたものを、フォントファイル形式にして販売する行為。\n";
			_info += "\n";
			_info += "\n";
			_info += "■動作環境\n";
			_info += "Microsoft Windows 95/98/Me/NT4.0/2000/XP/Vista/7\n";
			_info += "Mac OS X 10.3以降\n";
			_info += "\n";
			_info += "\n";
			_info += "■フォント作成環境\n";
			_info += "武蔵システム「TTEdit（Ver7.61）」で作成しました。\n";
			_info += "http://musashi.or.tv/\n";
			_info += "\n";
			_info += "\n";
			_info += "■更新履歴\n";
			_info += "\n";
			_info += "2012/07/25	ver 1.00	フォントの配布を開始しました。\n";
			_info += "\n";
			_info += "\n";
			_info += "***************************************************\n";
			_info += "\n";
			_info += "たぬきフォント\n";
			_info += "http://tanukifont.sblo.jp/\n";
			_info += "作者への連絡は上記サイトのメールフォームをご利用ください。\n";
			_info += "\n";
			_info += "***************************************************\n";
			_info += "";
			super();
		}
	}
	
}